package com.ffapp.bbtimeline.common.util;

import java.util.ArrayList;
import java.util.List;

/**
 * 资源表 内容
 * 
 * @author Administrator
 * 
 */
public class ResourceUtil {
	public static String[] base = new String[] { "银行机构2", "国有", "股份", "城商",
			"农商", "外资" };
	public static String[] yinhang = new String[] { "国有银行", "股份制银行", "城商行",
			"农商行", "外资银行", "银行机构" };
	public static String[] jigou = new String[] { "银行机构", "人民银行", "银监会",
			"银行业协会", "中国银联", "国开行", "农业发展", "进出口" };
	public static String[] guoyou = new String[] { "国有", "中行", "农行", "工行",
			"建行", "交行", "邮储" };
	public static String[] gufen = new String[] { "股份", "招商", "中信", "民生", "华夏",
			"广发", "浦发", "光大", "兴业", "平安", "渤海", "浙商" };
	public static String[] chengshang = new String[] { "城商", "北京", "上海", "江苏",
			"南京", "富滇", "徽商", "天津", "重庆", "汉口", "宁波", "广州", "河北", "长沙", "杭州",
			"成都", "东莞", "晋商", "齐鲁", "青岛", "龙江", "盛京", "吉林", "包商", "朝阳", "鞍山",
			"营口", "锦州", "大连", "阜新", "桂林", "大庆", "柳州", "泉州", "温州", "南昌", "台州",
			"衡水", "廊坊", "唐山", "邢台", "沧州", "承德", "邯郸", "保定", "泉阳", "长治", "晋城",
			"大同", "晋中", "乌海", "抚顺", "丹东", "辽阳", "铁岭", "长江", "嘉兴", "湖州", "绍兴",
			"金华", "泰隆", "民泰", "稠州", "厦门", "九江", "上饶", "赣州", "济宁", "临商", "东营",
			"潍坊", "烟台", "威海", "齐商", "泰安", "日照", "莱商", "德州", "郑州", "开封", "洛阳",
			"焦作", "许昌", "新乡", "南阳", "信阳", "鹤壁", "安阳", "漯河", "周口", "华润", "北部湾",
			"三峡", "自贡", "乐山", "南充", "雅安", "贵阳", "德阳", "泸州", "苏州", "昆仑", "西安",
			"兰州", "宜宾", "遂宁", "遵义", "安顺", "曲靖", "福建海峡", "攀枝花", "青海", "宁夏",
			"鄂尔多斯", "葫芦岛", "玉溪", "张家口", "乌鲁木齐", "库尔勒", "凉山州", "广东南粤", "厦门国际",
			"哈尔滨", "平顶山", "内蒙古" };
	public static String[] nongshang = new String[] { "农商", "北京农商", "上海农商",
			"深圳农商", "常熟农商", "天津农商", "锡州农商", "江阴农商", "张家港农商", "吴江农商", "昆山农商",
			"太仓农商", "芜湖扬子农商", "重庆农商", "九台农商", "马鞍山农商", "长春农商", "武汉农商",
			"合肥科技农商", "伊川农商", "靖江农商", "广州农商", "顺德农商", "东莞农商", "江苏射阳农商", "成都农商",
			"江南农商", "安徽肥西农商", "南昌洪都农商", "鄂尔多斯农商", "池州九华农商", "沧州融信农商", "宁夏黄河农商",
			"山东莱州农商", "山东邹平农商", "安庆独秀农商", "三门峡湖滨农商" };
	public static String[] waizi = new String[] { "外资", "东亚银行", "汇丰中国", "花旗银行",
			"恒丰银行", "渣打银行", "恒生银行", "星展银行", "华侨银行", "德意志银行", "永亨银行", "南洋商业银行",
			"友利银行", "巴黎银行", "大华银行", "韩亚银行", "华商银行", "华一银行", "协和银行", "华美银行",
			"新韩银行", "大新银行", "外换银行", "盘古银行", "首都银行", "正信银行", "瑞惠银行", "法国兴业银行",
			"摩根士丹利", "三菱东京日联", "三井住友银行", "摩根大通银行" };

	public static String[] xintuo2 = new String[] { "爱建信托", "安信信托", "百瑞信托",
			"北方信托", "北京信托", "渤海信托", "长安信托", "长城信托", "大业信托", "东莞信托", "方正信托",
			"甘肃信托", "国联信托", "国民信托", "国投信托", "国元信托", "杭州信托", "湖南信托", "华澳信托",
			"华宝信托", "华宸信托", "华能信托", "华融信托", "华润信托", "华鑫信托", "华信信托", "吉林信托",
			"建信信托", "江苏信托", "交银信托", "金谷信托", "昆仑信托", "陆家嘴信托", "平安信托", "山东信托",
			"山西信托", "陕西国投", "上海信托", "四川信托", "苏州信托", "天津信托", "外贸信托", "万向信托",
			"五矿信托", "西部信托", "西藏信托", "厦门信托", "新华信托", "新时代信托", "兴业信托", "英大信托",
			"粤财信托", "云南信托", "浙金信托", "中诚信托", "中海信托", "中航信托", "中江信托", "中粮信托",
			"中融信托", "中泰信托", "中铁信托", "中投信托", "中信信托", "中原信托", "重庆信托", "紫金信托",
			"民生信托" };
	public static String[] xintuo = new String[] { "信托公司" };

	public static String[] xuqiu = new String[] { "上市公司", "地产公司", "高级会所",
			"行业协会", "汽车公司", "名表公司", "公募基金", "PE公司", "VC公司", "高端俱乐部", "高尔夫球场",
			"马场", "医院", "美容机构", "大学", "移民公司", "担保公司", "广告公司", "连锁企业", "教育机构",
			"培训机构", "餐饮企业", "服装", "旅行社", "政府", "礼品公司", "文化公司", "律师事务所",
			"会计事务所", "法院" };

	public static String[] shangshi = new String[] { "上市公司" };
	public static String[] shangshi2 = new String[] { "中成进出口股份有限公司",
			"中国天地卫星股份有限公司", "北京燕化高新技术股份有限公司", "北京市大龙伟业房地产开发股份有限公司",
			"北京燕京啤酒股份有限公司", "中牧实业股份有限公司", "金融街控股股份有限公司", "中青旅控股股份有限公司",
			"经纬纺织机械股份有限公", "北京天坛生物制品股份有限公司", "中国有色金属建设股份有限公司", "大唐电信科技股份有限公司",
			"北京赛迪传媒投资股份有限公司", "华夏建通科技开发股份有限公司", "京东方科技集团股份有限公司",
			"北汽福田汽车股份有限公司", "北新集团建材股份有限公司", "有研半导体材料股份有限公司", "四环药业股份有限公司",
			"中体产业集团股份有限公司", "北京化二股份有限公司", "中国玻纤股份有限公司", "中水集团远洋股份有限公司",
			"北京万通先锋置业股份有限公司", "北京京西风光旅游开发股份有限公司", "北京首都旅游股份有限公司", "紫光股份有限公司",
			"中垦农业资源开发股份有限公司", "北京华胜天成科技股份有限公司", "北京空港科技园区股份有限公司",
			"中信国安信息产业股份有限公司", "路桥集团国际建设股份有限公司", "北京首钢股份有限公司", "北京华联综合超市股份有限公司",
			"北京三元食品股份有限公司", "北京中创信测科技股份有限公司", "北京顺鑫农业股份有限公司", "北京城建投资发展股份有限公司",
			"安泰科技股份有限公司", "北京天鸿宝业房地产股份有限公司", "北京北方天鸟智能科技股份有限公司",
			"国药集团药业股份有限公司", "北京华联商厦股份有限公司", "中外运空运发展股份有限公司", "北京中科三环高技术股份有限公司",
			"北京巴士股份有限公司", "北京空港科技园区股份有限公司", "中国软件与技术服务股份有限公司", "中国服装股份有限公司",
			"航天信息股份有限公司", "北京动力源科技股份有限公司", "北京中创信测科技股份有限公司",
			"北京金自天正智能控制股份有限公司", "华北高速公路股份有限公司", "大恒新纪元科技股份有限公司",
			"北京华胜天成科技股份有限公司", "国药集团药业股份有限公司", "北京京能热电股份有限公司",
			"北京中关村科技发展(控股)股份有限公司", "蓝星化工新材料股份有限公司", "中国国际贸易中心股份有限公司",
			"北京北方天鸟智能科技股份有限公司", "北京金自天正智能控制股份有限公司", "天地科技股份有限公司",
			"中国长江电力股份有限公司", "用友软件股份有限公司", "北京首创股份有限公司", "北京市西单商场股份有限公司",
			"华夏银行股份有限公司", "北京航天长峰股份有限公司", "国投中鲁果汁股份有限公司", "北京天桥北大青鸟科技股份有限公司",
			"华能国际电力股份有限公司", "中电广通股份有限公司", "中国石油化工股份有限公司", "北京王府井百货(集团)股份有限公司",
			"北矿磁材科技股份有限公司", "北京兆维科技股份有限公司", "五矿发展股份有限公司", "天创置业股份有限公司",
			"北京歌华有线电视网络股份有限公司", "北人印刷机械股份有限公司", "北京万东医疗装备股份有限公司",
			"北京城乡贸易中心股份有限公司", "北京双鹤药业股份有限公司", "中国长江电力股份有限公司", "北矿磁材科技股份有限公司",
			"中技贸易股份有限公司", "中房置业股份有限公司", "同方股份有限公司" };

	public static String[] licai = new String[] { "三方财富" };
	public static String[] licai2 = new String[] { "恒天财富", "大唐财富", "高晟财富",
			"新湖财富", "展恒理财", "郁金香财富", "诺亚财富", "格上理财", "宜信财富", "汇付天下", "好买基金",
			"富高财富", "瀚亚资本", "优选财富", "天保财富", "裕信财富", "中金诺财富", "中投银华", "丰景财富",
			"银创财富", "鼎力财富", "领航者财富", "华创财富", "红果树财富", "普益财富", "启元财富", "优利理财",
			"百盛财富", "极元财富", "康宏财富", "阿拉丁财富", "华鼎财富", "君富财富", "融发财富", "红轩财富",
			"元道和明", "有方有道", "大正财富", "合瑞投资", "金宝怡财富", "华夏财富", "中瑞富信", "幸汇财富",
			"银率网", "元贞财富", "安信财富", "格好财富", "恒久财富", "耶鲁财富", "大成财富", "环球财富",
			"路透财富", "恒生财富", "姆桑财富", "唐古拉财富", "丰汇通财富", "守得理财", "瑞盈财富", "华融君安",
			"汉赫资产", "个信财富", "高傅财富", "中天嘉华", "多多财富", "无锡丰汇通财富", "启华财富", "紫宸财富",
			"卓越财富", "阳光财富", "上海伟亿财富", "指南针财富", "宏大财富", "第一信托网", "用益网", "上海利得",
			"上海五色土", "成都汉和", "广州安盈", "杭州德锐", "银夏财富", "世德贝", "飞顿理财", "翘华控股",
			"鑫土财富", "大德财富", "德瑞投资", "圭盾财富" };

	public static String[] zhengjuan2 = new String[] { "爱建证券", "安信证券",
			"北京高华证券", "渤海证券", "财达证券", "财富里昂证券 ", "财富证券", "财通证券", "长城证券",
			"长江证券承销保荐", "长江证券", "诚浩证券", "川财经纪证券", "大通证券", "大同证券经纪", "德邦证券",
			"第一创业摩根大通证券", "第一创业证券", "东北证券", "东方证券", "东海证券", "东吴证券", "东兴证券",
			"东莞证券", "方正证券", "高盛高华证券", "光大证券", "广发证券", "广州证券", "国都证券", "国海证券",
			"国金证券", "国开证券", "国联证券", "国盛证券", "国泰君安证券", "国信证券", "国元证券", "海际大和证券",
			"海通证券", "航天证券", "和兴证券经纪", "恒泰长财证券", "恒泰证券", "宏源证券", "红塔证券", "华安证券",
			"华宝证券", "华创证券", "华福证券", "华林证券", "华龙证券", "华融证券", "华泰联合", "华泰证券",
			"华西证券", "华英证券", "华鑫证券", "江海证券", "金元证券", "开源证券", "联讯证券", "民生证券",
			"摩根士丹利华鑫证券", "南京证券", "平安证券", "齐鲁证券", "日信证券", "瑞信方正证券", "瑞银证券",
			"山西证券", "上海东方证券资产管理", "上海证券", "申银万国证券", "世纪证券", "上海光大证券资产管理",
			"首创证券", "太平洋证券", "天风证券", "天源证券", "万和证券", "万联证券", "五矿证券", "西部证券",
			"西藏同信证券", "西南证券", "厦门证券", "湘财证券", "新时代证券", "信达证券", "兴业证券", "银泰证券	",
			"英大证券", "招商证券", "浙商证券", "中德证券", "中国国际金融", "中国民族证券", "中国银河证券",
			"中国中投证券", "中航证券", "中山证券", "中天证券", "中信建投证券", "中信万通证券", "中信证券（浙江）",
			"中信证券", "中银国际证券", "中邮证券", "中原证券", "众成证券", "南阳"

	};
	public static String[] zhengjuan = new String[] { "证券公司" };

	public static String[] qihuo2 = new String[] { "北京中期", "金鹏期货经纪", "上海通联期货",
			"上海东证期货", "国都期货", "中粮期货", "海证期货", "上海中期期货", "北京首创期货", "一德期货",
			"中信新际期货", "同信久恒期货", "宏源期货", "第一创业期货", "江苏东华期货", "国联期货", "冠通期货",
			"国元期货", "创元期货", "东海期货", "经易期货经纪", "京都期货", "新纪元期货", "弘业期货", "中衍期货",
			"中钢期货", "文峰期货", "锦泰期货", "金谷期货", "财达期货", "浙江中大期货", "浙江新世纪期货",
			"泰君安期货", "象屿期货", "宝城期货", "大地期货", "和融期货经纪", "河北恒银期货经纪	", "浙商期货",
			"大越期货", "山西三立期货经纪", "民生期货", "信达期货", "新湖期货", "和合期货经纪", "鑫鼎盛期货",
			"南华期货", "国海良时期货", "深圳瑞龙期货", "华海期货", "永安期货", "宁波杉立期货经纪", "江海汇鑫期货",
			"江信国盛期货", "鲁证期货", "招金期货", "天富期货", "中融汇信期货", "中州期货", "英大期货",
			"大连良运期货经纪	", "兴证期货", "徽商期货", "华安期货", "晟鑫期货经纪", "天鸿期货经纪", "安粮期货",
			"格林期货", "黑龙江三力期货经纪", "大通期货经纪", "万达期货", "国信期货", "中投天琪期货", "银河期货",
			"中原期货", "金友期货经纪", "天风期货", "中国国际期货", "方正期货", "金信期货", "渤海期货", "国富期货",
			"美尔雅期货经纪", "新疆天利期货经纪", "海通期货", "华鑫期货", "华闻期货经纪", "长江期货", "光大期货",
			"上海金源期货", "南证期货", "江南期货经纪", "恒泰期货", "国投中谷期货", "华联期货", "华龙期货",
			"上海良茂期货经纪", "上海东亚期货", "广发期货", "华南期货经纪", "上海东方期货经纪", "上海大陆期货",
			"广东鸿海期货", "新晟期货", "东航期货", "上海中财期货", "集成期货", "摩根大通期货", "上海浙石期货经纪",
			"上海普民期货经纪", "华泰长城期货", "金石期货", "银建期货经纪", "国贸期货经纪", "中电投先融期货",
			"红塔期货", "中航期货经纪", "中证期货", "西部期货", "长安期货", "五矿期货", "招商期货", "东兴期货",
			"江西瑞奇期货经纪", "深圳金汇期货经纪", "乾坤期货", "迈科期货经纪", "黑龙江时代期货经纪", "海航东银期货",
			"神华期货经纪", "中辉期货经纪", "大有期货", "金瑞期货", "平安期货", "华创期货", "云晨期货",
			"金元期货经纪", "华融期货", "东吴期货", "广永期货", "道通期货经纪", "海南金海岸期货景", "盛达期货",
			"安信期货", "申银万国期货", "华西期货", "广州期货", "津投期货经纪", "瑞达期货", "国金期货", "财富期货",
			"东方汇金期货", "成都倍特期货经纪", "西南期货经纪", "德盛期货", "中银国际期货", "中信建投期货", "大华期货"

	};
	public static String[] qihuo = new String[] { "期货公司" };

	/**
	 * 获得银行篇 第一题所有列表
	 * 
	 * @return
	 */
	public static List<PerBean> getYinhangList() {
		List<PerBean> list = new ArrayList<PerBean>();

		/*
		 * for (int i = 0; i < jigou.length; i++) { PerBean perBean = new
		 * PerBean(); perBean.setName(jigou[i]); list.add(perBean); } for (int i
		 * = 0; i < guoyou.length; i++) { PerBean perBean = new PerBean();
		 * perBean.setName(guoyou[i]); list.add(perBean); } for (int i = 0; i <
		 * gufen.length; i++) { PerBean perBean = new PerBean();
		 * perBean.setName(gufen[i]); list.add(perBean); } for (int i = 0; i <
		 * chengshang.length; i++) { PerBean perBean = new PerBean();
		 * perBean.setName(chengshang[i]); list.add(perBean); } for (int i = 0;
		 * i < nongshang.length; i++) { PerBean perBean = new PerBean();
		 * perBean.setName(nongshang[i]); list.add(perBean); } for (int i = 0; i
		 * < waizi.length; i++) { PerBean perBean = new PerBean();
		 * perBean.setName(waizi[i]); list.add(perBean); }
		 */
		for (int i = 0; i < yinhang.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(yinhang[i]);
			list.add(perBean);
		}
		return list;
	}

	/**
	 * 信托所有列表
	 * 
	 * @return
	 */
	public static List<PerBean> getXintuoList() {
		List<PerBean> list = new ArrayList<PerBean>();

		for (int i = 0; i < xintuo.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(xintuo[i]);
			list.add(perBean);
		}
		return list;
	}

	/**
	 * 证劵
	 * 
	 * @return
	 */
	public static List<PerBean> getZhengjuanList() {
		List<PerBean> list = new ArrayList<PerBean>();

		for (int i = 0; i < zhengjuan.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(zhengjuan[i]);
			list.add(perBean);
		}
		return list;
	}

	/**
	 * 期货
	 * 
	 * @return
	 */
	public static List<PerBean> getQihuoList() {
		List<PerBean> list = new ArrayList<PerBean>();

		for (int i = 0; i < qihuo.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(qihuo[i]);
			list.add(perBean);
		}
		return list;
	}

	/**
	 * 三方理财
	 * 
	 * @return
	 */
	public static List<PerBean> getLicaiList() {
		List<PerBean> list = new ArrayList<PerBean>();

		for (int i = 0; i < licai.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(licai[i]);
			list.add(perBean);
		}
		return list;
	}

	/**
	 * 上市公司
	 * 
	 * @return
	 */
	public static List<PerBean> getShangshiList() {
		List<PerBean> list = new ArrayList<PerBean>();

		for (int i = 0; i < shangshi.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(shangshi[i]);
			list.add(perBean);
		}
		return list;
	}

	/**
	 * 需求所有列表
	 * 
	 * @return
	 */
	public static List<PerBean> getXuqiuList() {
		List<PerBean> list = new ArrayList<PerBean>();

		for (int i = 0; i < xuqiu.length; i++) {
			PerBean perBean = new PerBean();
			perBean.setName(xuqiu[i]);
			list.add(perBean);
		}
		return list;
	}

	public static boolean contains(String name) {
		for (int i = 0; i < base.length; i++) {
			if (base[i].equals(name)) {
				return true;
			}
		}
		return false;
	}
}
